.emacs.d/Emacs.org
#+title Emacs From Scratch Configuration
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el

* Auto-tangle Configuration Files
#+begin_src emacs-lisp
  ;; Automatically tangle our Emacs.org config file when we save it
  (defun efs/org-babel-tangle-config ()
    (when (string-equal (buffer-file-name)
                        (expand-file-name "~/.dotfiles/.emacs.d/Emacs.org"))
      ;; Dyname scoping to the rescue
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))

  (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'efs/org-babel-tangle-config)))
#+end_src

* Boostrap straight.el
#+begin_src emacs-lisp
  (defvar bootstrap-version)
  (let ((bootstrap-file
	 (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
	(bootstrap-version 6))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
	  (url-retrieve-synchronously
	   "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
	   'silent 'inhibit-cookies)
	(goto-char (point-max))
	(eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))
  (setq straight-use-package-by-default t) ;; Automatically use `straight.el` with `use-package`


  (use-package no-littering)
#+end_src

* Package Upgrades
#+begin_src emacs-lisp
  ;; Functions for upgrading packages
  (defun efs/upgrade-all-packages ()
    "Upgrade all straight.el packages."
    (interactive)
    (message "Upgrading all packages...")
    (straight-pull-all)
    (straight-rebuild-all)
    (message "All packages upgraded!"))

  (defun efs/upgrade-package (package)
    "Upgrade a specific PACKAGE."
    (interactive
     (list (completing-read "Upgrade package: "
                           (straight--installed-packages)
                           nil t)))
    (message "Upgrading %s..." package)
    (straight-pull-package package)
    (straight-rebuild-package package)
    (message "Package %s upgraded!" package))

  ;; Add these to global key bindings
  (global-set-key (kbd "C-c u a") 'efs/upgrade-all-packages)
  (global-set-key (kbd "C-c u p") 'efs/upgrade-package)
#+end_src

* Basic UI Configuration

** Fonts and Default Sizes
#+begin_src emacs-lisp
  ;; You will most likely need to adjust this font size for your system!
  ;; If fonts are missing
  ;; sudo apt install fonts-firacode fonts-cantarell
  (defvar efs/default-font-size 120)
  (defvar efs/default-variable-font-size 120)
  (defvar efs/default-font-family "Fira Code")
  (defvar efs/fixed-font-family "Fira Code")
  (defvar efs/variable-font-family "Cantarell")
  (defvar efs/default-fill-column 112)

  ;; Make frame transparency overridable
  (defvar efs/frame-transparency '(90 . 90))
#+end_src

** MacOS Overrides
#+begin_src emacs-lisp
  ;; MacOS key bindings
  (when (eq system-type 'darwin) ;; mac specific settings
    (message "adding %s inits" (system-name))

    ;; osx may require the following...
    ;;
    ;; brew install svn
    ;; brew tap homebrew/cask-fonts
    ;; brew install --cask font-fira-code font-fira-mono
    ;; brew install --cask font-cantarell
    ;; brew install coreutils

    ;; these mac-* settings assumes System->Keyboard->Modifier Keys...
    ;; Caps Lock Key: Control
    ;; Control Key  : Option
    ;; Option Key   : Command
    ;; Command Key  : Command
    (setq mac-control-modifier 'super)
    (setq mac-command-modifier 'control)
    (setq mac-option-modifier 'meta)
    (setq insert-directory-program "gls" dired-use-ls-dired t)

    ;; nice up the osx screen on 3440x1440 display
    (setq efs/default-font-size 160)
    (setq efs/default-variable-font-size 160))
#+end_src

** Emacs GC and Efficiency Configuration
#+begin_src emacs-lisp
  ;; The default is 800 kilobytes.  Measured in bytes.
  (setq gc-cons-threshold (* 500 1000 1000))
  (setq read-process-output-max (* 2 1024 1024))
#+end_src

** Startup and Frame Setup
#+begin_src emacs-lisp
  (defun efs/display-startup-time ()
    (message "Emacs loaded in %s with %d garbage collections."
             (format "%.2f seconds"
                     (float-time
                      (time-subtract after-init-time before-init-time)))
             gcs-done))

  (add-hook 'emacs-startup-hook #'efs/display-startup-time)

  ;; top level look/feel
  (setq inhibit-startup-message t)

  (if window-system
      (progn
        (set-fringe-mode 10)        ; Give some breathing room
        (scroll-bar-mode -1)))        ; Disable visible scrollbar

  (tool-bar-mode -1)          ; Disable the toolbar
  (tooltip-mode -1)           ; Disable tooltips
  (display-time-mode 1)       ; Anyone know what time it is?
  (menu-bar-mode -1)            ; Disable the menu bar

  ;; Set up the visible bell
  (setq visible-bell t)
#+end_src

** Line and Column Numbers
#+begin_src emacs-lisp
  ;; line and column numbers
  (column-number-mode)
  (global-display-line-numbers-mode t)
  ;; Disable line numbers for some modes
  (dolist (mode '(org-mode-hook
                  term-mode-hook
                  shell-mode-hook
                  treemacs-mode-hook
                  eshell-mode-hook
                  dired-mode-hook
                  org-agenda-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))
#+end_src

** Font Configuration

#+begin_src emacs-lisp
  ;; default face
  (set-face-attribute 'default nil
                      :font efs/default-font-family
                      :height efs/default-font-size)
  ;; Set the fixed pitch face
  (set-face-attribute 'fixed-pitch nil
                      :font efs/fixed-font-family
                      :height efs/default-font-size)
  ;; Set the variable pitch face
  (set-face-attribute 'variable-pitch nil
                      :font efs/variable-font-family
                      :height efs/default-variable-font-size
                      :weight 'regular)
#+end_src

** Global Auto Revert
#+begin_src emacs-lisp
  (global-auto-revert-mode 1)
#+end_src

* Themes, Icons, Modeline, Delimiter Matching
#+begin_src emacs-lisp
  ;;(load-theme 'tango-dark)
  ;; have tried: doom-palenight doom-material-dark doom-solarized-light doom-solarized-light doom-zenburn doom-monokai-machine doom-oceanic-next
  (use-package doom-themes
    :init (load-theme 'doom-solarized-light t)
    :config
    (custom-set-faces
     '(region ((t (:background "#cfcbc6"))))))

  ;; Replace the all-the-icons package with nerd-icons
  ;; all-the-icons is broken in doomemacs, see
  ;; https://github.com/doomemacs/doomemacs/issues/7379
  ;;
  ;; You may need to
  ;; M-x nerd-icons-install-fonts
  ;; and
  ;; fc-cache -f -v # from shell
  (use-package nerd-icons
    :if (display-graphic-p)
    :commands nerd-icons-install-fonts
    :init
    (unless (find-font (font-spec :name "Symbols Nerd Font Mono"))
      (nerd-icons-install-fonts t)))

  (use-package doom-modeline
    :init (doom-modeline-mode 1)
    :custom
    ((doom-modeline-height 15)
     (doom-modeline-icon t)
     (doom-modeline-major-mode-icon t)
     (doom-modeline-major-mode-color-icon t)))

  (use-package rainbow-delimiters
    :defer t
    :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

* Global Key Bindings
#+begin_src emacs-lisp
  ;; Make ESC quit prompts
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)

  ;; from https://www.fettesps.com/emacs-disable-suspend-button/
  ;; Unbind Pesky Sleep Button
  (global-unset-key [(control z)])
  (global-unset-key [(control x)(control z)])

  ;; Windows Style Undo
  (global-set-key [(control z)] 'undo)

  ;; Comment toggle
  (global-set-key (kbd "C-c C-/") 'comment-or-uncomment-region)
#+end_src

