.emacs.d/Emacs.org
* General, Ivy, Counsel
#+begin_src emacs-lisp
  (use-package general)

  (use-package which-key
    :defer t
    :init
    (which-key-mode)
    :config
    (setq which-key-idle-delay 1))

  (use-package ivy
    :diminish
    :bind (("C-s" . swiper)
	   ("C-c i" . imenu)
	   :map ivy-minibuffer-map
	   ("TAB" . ivy-alt-done)
	   ("C-l" . ivy-partial)
	   :map ivy-switch-buffer-map
	   ("C-l" . ivy-partial)
	   ("C-d" . ivy-switch-buffer-kill)
	   :map ivy-reverse-i-search-map
	   ("C-d" . ivy-reverse-i-search-kill))
    :config
    (ivy-mode 1))

  (global-set-key (kbd "C-M-j") 'counsel-switch-buffer)
  (define-key emacs-lisp-mode-map (kbd "C-x M-t") 'counsel-load-theme)

  (use-package counsel
    :bind (("C-M-j" . 'counsel-switch-buffer)
	   :map minibuffer-local-map
	   ("C-r" . 'counsel-minibuffer-history))
    :custom
    (counsel-linux-app-format-function #'counsel-linux-app-format-function-name-only)
    :config
    (counsel-mode 1))

  (use-package ivy-rich
    :after ivy
    :init
    (ivy-rich-mode 1))
#+end_src

* Helpful Help Buffers
#+begin_src emacs-lisp
  (use-package helpful
    :defer t
    :commands (helpful-callable helpful-variable helpful-command helpful-key)
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable)
    :bind
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable)
    ([remap describe-key] . helpful-key))
#+end_src

* Eshell
#+begin_src emacs-lisp
  (use-package exec-path-from-shell
    :init (exec-path-from-shell-initialize))
  ;; eshell
  (defun efs/configure-eshell ()
    ;; Save command history when commands are entered
    (add-hook 'eshell-pre-command-hook 'eshell-save-some-history)

    ;; Truncate buffer for performance
    (add-to-list 'eshell-output-filter-functions 'eshell-truncate-buffer)

    (setq eshell-history-size         100000
          eshell-buffer-maximum-lines 100000
          eshell-hist-ignoredups t
          eshell-scroll-to-bottom-on-input t))

  (use-package eshell-git-prompt
    :after eshell)

  (use-package eshell
    :hook (eshell-first-time-mode . efs/configure-eshell)
    :bind (("C-r" . 'counsel-esh-history))
    :config

    (with-eval-after-load 'esh-opt
      (setq eshell-destroy-buffer-when-process-dies nil)
      (setq eshell-visual-commands '("htop"
                                     "zsh"
                                     "vim"
                                     "ntl"
                                     "netlify"
                                     "python"
                                     "ipython"
                                     "psql"
                                     "ssh"
                                     "mysql"
                                     "poetry"
                                     "docker"
                                     "ansible-playbook"
                                     "hugo"
                                     "aws"
                                     "copilot")))

    (eshell-git-prompt-use-theme 'powerline))
#+end_src

* Dired
#+begin_src emacs-lisp
  (use-package dired
    :straight (:type built-in)  ;; Tell straight.el this is a built-in package
    :commands (dired dired-jump)
    :bind (("C-x C-j" . dired-jump))
    :custom
    (dired-listing-switches "-aghoL --group-directories-first"))
#+end_src

* Dirvish
** Reference

*** Prerequisites
**** Installing fd
fd is a modern alternative to find. Install it based on your platform:

***** Ubuntu/Debian
Install using: sudo apt update && sudo apt install fd-find
Then create symlink since Debian-based systems name it fdfind:
Create a symlink from fdfind to fd in your ~/.local/bin directory

***** MacOS
Install using Homebrew: brew install fd

***** Arch Linux
Install using pacman: sudo pacman -S fd

*** Key Features
- Enhanced file preview capabilities
- Advanced file operations with visual feedback
- Customizable layout and display options
- File type icons integration with nerd-icons
- Advanced search and filtering capabilities
- Git integration for repository awareness
- History tracking for directory navigation

*** Key Bindings
All key bindings are available within dirvish-mode-map:

**** Navigation
- =a= - Quick access to predefined directories
- =^= - Go to previous directory in history
- =h= - Jump to directory in history
- =M-f= - Forward in history
- =M-b= - Backward in history
- =N= - Narrow the view (filter)
- =TAB= - Toggle subtree expansion

**** Operations
- =f= - File information menu
- =y= - Yank (copy) menu
- =v= - Version control menu
- =s= - Quick sort options

**** Layout and Display
- =M-t= - Toggle layout mode
- =M-l= - ls switches menu
- =M-s= - Setup menu
- =M-e= - Emerge (compare) menu

*** Customization Options
**** Quick Access Setup
The quick-access-entries variable allows you to define shortcuts to frequently accessed directories. Each entry consists of a key, path, and description.

**** Display Attributes
Dirvish can display various file attributes including icons, file times, sizes, VC state, and more. These can be customized through the dirvish-attributes variable.

**** Mode Line Format
The mode line can be customized to show different information including sort status, symlink info, omit status, and yank status.

**** Directory Listing Options
Directory listing can be customized to show various information in different formats, including human-readable sizes and directory-first sorting.

*** Advanced Features
**** Preview Configuration
File preview can be enabled in the minibuffer, providing quick looks at file contents without opening them.

**** Automatic Directory Following
Directory tracking can be enabled to automatically update the dirvish buffer based on your current working directory.

**** File Search Integration
Dirvish integrates with fd for advanced file searching:
- Use C-c f to invoke fd search in current directory
- Results are displayed in dirvish buffer
- Supports all fd command line options
- Can be combined with project.el for project-wide searches

*** Troubleshooting Tips
1. If icons are not displaying:
   - Install nerd-icons fonts using M-x nerd-icons-install-fonts
   - Run fc-cache -f -v from shell
   - Restart Emacs

2. If preview is not working:
   - Check if required preview programs are installed
   - Verify preview dispatcher configuration

3. For performance issues:
   - Disable heavy attributes in attributes configuration
   - Adjust cache directory location
   - Consider disabling peek mode for large directories

** Code
#+begin_src emacs-lisp
  ;; Load server explicitly before dirvish
  (require 'server)

  (use-package dirvish
    :straight (dirvish :type git :host github :repo "alexluigit/dirvish")
    :init
    (dirvish-override-dired-mode)
    :custom
    (dirvish-quick-access-entries ; It's a custom option, `setq' won't work
     '(("h" "~/"                          "Home")
       ("d" "~/Downloads/"                "Downloads")
       ("p" "~/Projects/"                 "Projects")
       ("s" "~/Screenshots/"              "Screenshots")))
    :config
    ;; (dirvish-peek-mode) ; Preview files in minibuffer
    ;; (dirvish-side-follow-mode) ; similar to `treemacs-follow-mode'
    (setq dirvish-mode-line-format
          '(:left (sort symlink) :right (omit yank index)))
    (setq dirvish-attributes
          '(nerd-icons file-time file-size collapse subtree-state vc-state))
    (setq delete-by-moving-to-trash nil)
    (setq dirvish-hide-details nil)
    (setq dired-listing-switches
          "-l --almost-all --human-readable --group-directories-first --no-group")
    :bind ; Bind `dirvish|dirvish-side|dirvish-dwim' as you see fit
    (("C-c f" . dirvish-fd)
     :map dirvish-mode-map ; Dirvish inherits `dired-mode-map'
     ("a"   . dirvish-quick-access)
     ("f"   . dirvish-file-info-menu)
     ("y"   . dirvish-yank-menu)
     ("N"   . dirvish-narrow)
     ("h"   . dirvish-history-jump) ; remapped `describe-mode'
     ("s"   . dirvish-quicksort)    ; remapped `dired-sort-toggle-or-edit'
     ("v"   . dirvish-vc-menu)      ; remapped `dired-view-file'
     ("TAB" . dirvish-subtree-toggle)
     ("M-f" . dirvish-history-go-forward)
     ("M-b" . dirvish-history-go-backward)
     ("M-l" . dirvish-ls-switches-menu)
     ("M-m" . dirvish-mark-menu)
     ("M-t" . dirvish-layout-toggle)
     ("M-s" . dirvish-setup-menu)
     ("M-e" . dirvish-emerge-menu)
     ("M-j" . dirvish-fd-jump)))
#+end_src

* Eat Terminal
** Reference
*** General Input Bindings
- ~C-q~ - Send next key to the terminal
- ~C-y~ - Like `yank`, but send the text to the terminal
- ~M-y~ - Like `yank-pop`, but send the text to the terminal
- ~C-c C-k~ - Kill process

*** Input Mode Switching
- ~C-c C-e~ - Switch to "emacs" input mode
- ~C-c C-j~ - Switch to "semi-char" input mode
- ~C-c M-d~ - Switch to "char" input mode
- ~C-c C-l~ - Switch to "line" input mode

*** Mode-Specific Bindings

**** Emacs Mode
No special keybindings except mode switching and process control:
- ~C-c C-j~ - Switch to "semi-char" input mode
- ~C-c M-d~ - Switch to "char" input mode
- ~C-c C-l~ - Switch to "line" input mode
- ~C-c C-k~ - Kill process

**** Char Mode
All supported keys are bound to send the key to the terminal, except:
- ~C-M-m~ or ~M-RET~ - Switch to "semi-char" input mode

**** Line Mode
Similar to Comint, Shell mode and Term line mode. Terminal input is sent one line at a time:
- ~C-c C-e~ - Switch to "emacs" input mode
- ~C-c C-j~ - Switch to "semi-char" input mode
- ~C-c M-d~ - Switch to "char" input mode
  
