.emacs.d/Emacs.org
* Org Mode
#+begin_src emacs-lisp
  ;; org mode
  (defun efs/org-font-setup ()
    ;; Replace list hyphen with dot
    (font-lock-add-keywords 'org-mode
                            '(("^ *\\([-]\\) "
                               (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

    ;; Set faces for heading levels
    (dolist (face '((org-level-1 . 1.4)
                    (org-level-2 . 1.3)
                    (org-level-3 . 1.2)
                    (org-level-4 . 1.1)
                    (org-level-5 . 1.1)
                    (org-level-6 . 1.1)
                    (org-level-7 . 1.1)
                    (org-level-8 . 1.1)))
      (set-face-attribute (car face) nil :font "Cantarell" :weight 'regular :height (cdr face)))

    ;; Ensure that anything that should be fixed-pitch in Org files appears that way
    (set-face-attribute 'org-block nil    :foreground nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-table nil    :inherit 'fixed-pitch)
    (set-face-attribute 'org-formula nil  :inherit 'fixed-pitch)
    (set-face-attribute 'org-code nil     :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-table nil    :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-checkbox nil  :inherit 'fixed-pitch)
    (set-face-attribute 'line-number nil :inherit 'fixed-pitch)
    (set-face-attribute 'line-number-current-line nil :inherit 'fixed-pitch))

  (defun efs/org-mode-setup ()
    (org-indent-mode)
    (variable-pitch-mode 1)
    (visual-line-mode 1))

  (use-package org
    :straight (:type built-in)
    :commands (org-capture org-agenda)
    :hook (org-mode . efs/org-mode-setup)
    :config
    (setq-default fill-column efs/default-fill-column)
    (setq org-ellipsis " ▾")

    (setq org-agenda-start-with-log-mode t)
    (setq org-log-done 'time)
    (setq org-log-into-drawer t)
    (setq org-image-actual-width (list 640))

    (setq org-directory "~/org")
    (setq org-agenda-files '("~/org"))
    (when (file-exists-p "~/Blogs/rmorison.github.io/org")
      (add-to-list 'org-agenda-files "~/Blogs/rmorison.github.io/org"))

    (setq org-agenda-compact-blocks t)

    (setq org-refile-use-outline-path 'file)
    (setq org-outline-path-complete-in-steps nil)
    (setq org-refile-allow-creating-parent-nodes 'confirm)
    (setq org-refile-targets '((nil :maxlevel . 9)
                               (org-agenda-files :maxlevel . 9)))

    ;; Save Org buffers after refiling!
    (advice-add 'org-refile :after 'org-save-all-org-buffers)

    (require 'org-habit)
    (add-to-list 'org-modules 'org-habit)
    (setq org-habit-graph-column 60)

    (setq org-todo-keywords
          '((sequence "TODO(t)" "NEXT(n)" "IN-PROGRESS(i!)" "|" "DONE(d!)" "WONT-DO(w@)" "DELEGATED(D@)" "HELD-BLOCKED(h@/!)" )
            (sequence "BREAKDOWN(b)" "READY(r)" "ACTIVE(a!)" "|" "DONE(d!)" "WONT-DO(w@)" "WATCHING(W@)" "HELD-BLOCKED(h@/!)")))

    (setq org-todo-keyword-faces
          (quote (("TODO" :foreground "orange" :weight bold)
                  ("BREAKDOWN" :foreground "dark orange" :weight bold)
                  ("NEXT" :foreground "aqua" :weight bold)
                  ("READY" :foreground "aqua" :weight bold)
                  ("IN-PROGRESS" :foreground "forest green" :weight bold)
                  ("ACTIVE" :foreground "green" :weight bold)
                  ("HELD-BLOCKED" :foreground "red" :weight bold)
                  ("DELEGATED" :foreground "purple" :weight bold)
                  ("WATCHING" :foreground "purple" :weight bold)
                  ("DONE" :foreground "white" :weight bold)
                  ("WONT-DO" :foreground "grey" :weight bold))))

    (setq org-tag-alist
          '((:startgroup)
                                          ; Put mutually exclusive tags here
            (:endgroup)
            ("project" . ?p)
            ("agenda" . ?a)
            ("meeting" . ?m)
            ("reference" . ?n)
            ("idea" . ?i)
            ("research" . ?r)
            ("goal" . ?g)))
    (setq org-fast-tag-selection-single-key t)

    ;; Configure custom agenda views
    (setq org-agenda-custom-commands
          '(("d" "Dashboard"
             ((agenda "" ((org-deadline-warning-days 7)))
              (todo "IN-PROGRESS" ((org-agenda-overriding-header "Tasks working on now")))
              (todo "ACTIVE" ((org-agenda-overriding-header "Projects that are active")))
              (todo "NEXT" ((org-agenda-overriding-header "Tasks next up")))
              (todo "DELEGATED" ((org-agenda-overriding-header "Tasks that are delegated")))
              (todo "WATCHING" ((org-agenda-overriding-header "Projects that I'm watching")))
              (todo "HELD-BLOCKED" ((org-agenda-overriding-header "Blocked projects and tasks")))))

            ("b" "Task backlog & project planning triage"
             ((todo "TODO" ((org-agenda-overriding-header "Task backlog")))
              (todo "BREAKDOWN" ((org-agenda-overriding-header "Projects that need planning")))))

            ("c" "Completed, planned, and wont-do tasks and projects"
             ((todo "DONE"
                    ((org-agenda-overriding-header "Tasks done"))))
             ((todo "WONT-DO"
                    ((org-agenda-overriding-header "Tasks optioned to the minors")))))))

    ;; Agenda sort
    (setq org-agenda-sorting-strategy
          '((agenda habit-down todo-state-down time-up priority-down category-keep)
            (todo priority-down category-keep)
            (tags priority-down category-keep)
            (search category-keep)))

    ;; Define capture templates
    (setq org-capture-templates
          `(("t" "Task" entry (file+headline "inbox.org" "Tasks")
             (file "templates/task.org"))

            ("h" "Habit" entry (file "habits.org")
             (file "templates/habit.org"))

            ("p" "Project" entry (file+headline "projects.org" "New Projects")
             (file "templates/project.org"))

            ("n" "Note" entry (file+headline "reference.org" "Notes")
             (file "templates/note.org"))

            ("N" "Private note" entry (file "private.org")
             (file "templates/note.org"))

            ("j" "Journal" entry (file+olp+datetree "journal.org")
             (file "templates/journal.org")
             :tree-type week)

            ("m" "Meeting" entry (file+olp+datetree "meetings.org")
             (file "templates/meeting.org")
             :tree-type week)

            ("1" "1-1 Meeting" entry (file+olp+datetree "meetings.org")
             (file "templates/1-1_meeting.org")
             :tree-type week)))

    (efs/org-font-setup))

  ;; org mode code blocks
  (with-eval-after-load 'org
    ;; This is needed as of Org 9.2
    (require 'org-tempo)

    (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
    (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
    (add-to-list 'org-structure-template-alist '("py" . "src python"))
    (add-to-list 'org-structure-template-alist '("go" . "src go"))
    (add-to-list 'org-structure-template-alist '("ya" . "src yaml"))
    (add-to-list 'org-structure-template-alist '("ty" . "src typescript"))
    (add-to-list 'org-structure-template-alist '("sq" . "src sql"))
    (add-to-list 'org-structure-template-alist '("mm" . "src mermaid"))

    ;; don't ask on eval block C-c C-c
    (setq org-confirm-babel-evaluate nil))

  ;; org mode key bindings
  (define-key global-map (kbd "C-c c")
    (lambda () (interactive) (org-capture nil)))
  ;;(global-set-key (kbd "\C-cc") 'org-capture)
  (define-key global-map (kbd "C-c l") 'org-store-link)
  (define-key global-map (kbd "C-c a") 'org-agenda)

  (use-package org-bullets
    :defer t
    :hook (org-mode . org-bullets-mode)
    :custom
    (org-bullets-bullet-list '("◉" "↪" "→" "○" "●" "✸" "✿" "•" "★" "•" "★" "•" "★")))

  (defun efs/org-mode-visual-fill ()
    (setq visual-fill-column-width efs/default-fill-column
          visual-fill-column-center-text t)
    (visual-fill-column-mode 1))

  (use-package visual-fill-column
    :defer t
    :hook (org-mode . efs/org-mode-visual-fill))
#+end_src

