.emacs.d/Emacs.org
** Configure Babel Languages
#+begin_src emacs-lisp
  (use-package ob-go
    :defer t
    :after org)

  (use-package ob-mermaid
    :defer t
    :after org
    :config
    (setq ob-mermaid-cli-path (expand-file-name "~/.nvm/versions/node/v18.16.0/bin/mmdc")))

  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (mermaid . t)
     (shell . t)
     (python . t)
     (go . t)))
#+end_src

* Yaml Mode
#+begin_src emacs-lisp
  ;; YAML Mode Configuration
  (use-package yaml-mode
    :mode ("\\.ya?ml\\'" . yaml-mode)
    :hook (yaml-mode . (lambda ()
                        (define-key yaml-mode-map "\C-m" 'newline-and-indent))))
#+end_src

* Markdown Mode
** Reference
*** Core Features
**** Basic Editing
- Syntax highlighting for Markdown text
- Support for GitHub Flavored Markdown (GFM)
- Automatic indentation and list formatting
- Wiki links support with ~[[link]]~ syntax
- Math expressions with LaTeX syntax

**** Document Navigation
- Imenu integration for headers (navigate with ~C-c C-j~)
- Structure movement commands (next/previous header, etc.)
- Outline-mode style visibility cycling with ~TAB~ on headers

**** Formatting Commands
- ~C-c C-s b~ - Insert bold text
- ~C-c C-s i~ - Insert italic text
- ~C-c C-s c~ - Insert inline code
- ~C-c C-s k~ - Insert block code
- ~C-c C-s q~ - Insert blockquote
- ~C-c C-s h~ - Insert header (level based on prefix arg)

**** Link & Image Handling
- ~C-c C-l~ - Insert or edit link
- ~C-c C-x i~ - Insert image
- ~C-c C-x u~ - Insert URI
- ~C-c C-s P~ - Pre-formatted text
- ~C-c C-s [~ - Reference link

**** Tables & Lists
- ~C-c C-s t~ - Generate table of contents
- ~C-c C-s a~ - Align table columns
- ~C-c C-s T~ - Insert table
- ~C-c C-c -~ - Convert line to horizontal rule
- ~C-c -~ - Insert horizontal rule
- ~M-RET~ - Insert new list item

**** Preview & Export
- ~C-c C-s p~ - Live preview in browser
- ~C-c C-c p~ - Export to HTML and preview
- ~C-c C-c e~ - Export to various formats via Pandoc

*** Package Integration
**** markdown-preview-mode
- Live browser preview with auto-refresh
- Supports GitHub CSS styling
- Code block syntax highlighting with highlight.js

**** markdown-toc
- ~markdown-toc-generate-toc~ - Generate TOC at point
- ~markdown-toc-refresh-toc~ - Update existing TOC
- Customizable TOC depth and formatting

**** flyspell
- Interactive spell checking
- Ignore code blocks and URLs
- ~M-$~ to correct words

**** markdownlint
- Style checking based on common Markdown rules
- Error highlighting with flymake
- Configurable via ~.markdownlint.json~ files

*** Installation Requirements
**** Pandoc (Required for best preview/export)
For previewing and conversion:
- Ubuntu/Debian: ~sudo apt-get install pandoc~
- MacOS: ~brew install pandoc~

**** markdownlint (Optional for linting)
For markdown style checking and linting:
- Install with npm: ~npm install -g markdownlint-cli~
- Or using yarn: ~yarn global add markdownlint-cli~

** Code
#+begin_src emacs-lisp
  ;; Markdown Mode for composing, editing, and reviewing markdown documents
  (use-package markdown-mode
    :mode (("README\\.md\\'" . gfm-mode)
           ("\\.md\\'" . markdown-mode)
           ("\\.markdown\\'" . markdown-mode))
    :init
    (setq markdown-command "pandoc")  ;; Use pandoc for previewing
    :custom
    (markdown-fontify-code-blocks-natively t)  ;; Syntax highlight code blocks
    (markdown-enable-math t)  ;; Enable LaTeX math support
    (markdown-enable-wiki-links t)  ;; Enable wiki-style links
    (markdown-italic-underscore t)  ;; Use underscores for italic
    (markdown-asymmetric-header t)  ;; Don't add trailing # on headers
    (markdown-gfm-additional-languages '("shell" "bash" "python" "sql" "go" "typescript"))
    (markdown-header-scaling t)  ;; Scale headers
    (markdown-header-scaling-values '(1.5 1.3 1.1 1.0 1.0 1.0))  ;; Header scaling factors
    (markdown-hide-urls nil)  ;; Show URLs
    (markdown-indent-on-enter t)  ;; Automatically indent new lines
    (markdown-make-gfm-checkboxes-buttons t)  ;; Make checkboxes clickable
    :config
    ;; Use visual-line-mode and visual-fill-column-mode for better text wrapping
    (add-hook 'markdown-mode-hook #'visual-line-mode)
    (add-hook 'markdown-mode-hook (lambda ()
                                    (setq visual-fill-column-width efs/default-fill-column)
                                    (visual-fill-column-mode 1)))
    
    ;; Key bindings
    :bind (:map markdown-mode-map
           ("C-c C-s a" . markdown-table-align)  ;; Align tables
           ("C-c C-s t" . markdown-toc-generate-toc)  ;; Generate TOC
           ("C-c C-s p" . markdown-live-preview-mode)  ;; Toggle preview
           ("C-c C-s m" . markdown-toggle-markup-hiding)  ;; Toggle markup hiding
           ("C-c C-x i" . markdown-insert-image)))  ;; Insert image

  ;; Live preview of Markdown
  (use-package markdown-preview-mode
    :after markdown-mode
    :custom
    (markdown-preview-stylesheets
     '("https://cdnjs.cloudflare.com/ajax/libs/github-markdown-css/5.2.0/github-markdown.min.css"))
    :config
    (add-to-list 'markdown-preview-javascript
                 "https://cdnjs.cloudflare.com/ajax/libs/highlight.js/11.7.0/highlight.min.js"))

  ;; Add markdown table of contents support
  (use-package markdown-toc
    :after markdown-mode)

  ;; Imenu integration for markdown headers
  (add-hook 'markdown-mode-hook
            (lambda ()
              (setq imenu-generic-expression
                    '(("Heading 1" "^# \\(.+\\)" 1)
                      ("Heading 2" "^## \\(.+\\)" 1)
                      ("Heading 3" "^### \\(.+\\)" 1)
                      ("Heading 4" "^#### \\(.+\\)" 1)
                      ("Heading 5" "^##### \\(.+\\)" 1)
                      ("Heading 6" "^###### \\(.+\\)" 1)))))

  ;; Enable flyspell for spell checking in markdown documents
  (add-hook 'markdown-mode-hook 'flyspell-mode)

  ;; Integrate with markdownlint if available
  (when (executable-find "markdownlint")
    (use-package flymake-markdownlint
      :after markdown-mode
      :hook (markdown-mode . flymake-markdownlint-setup)))
#+end_src

* Version Control
#+begin_src emacs-lisp
  ;; Magit configuration
  (use-package magit
    :commands magit-status
    :custom
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1)
    (git-commit-summary-max-length 88)
    (git-commit-fill-column 88)
    :bind
    ("C-x g" . magit-status)
    ("C-x M-g" . magit-dispatch))

  ;; Optional: show git changes in the gutter/fringe
  ;; Configure native-comp warnings before git-gutter
  (when (and (fboundp 'native-comp-available-p)
             (native-comp-available-p))
    (setq native-comp-async-report-warnings-errors 'silent) ; Silence all native-comp warnings
    ;; Optional: if you want to only silence specific warnings
    (add-to-list 'native-comp-eln-load-path (expand-file-name "eln-cache/" user-emacs-directory)))

  ;; This setting is safe regardless of native-comp support
  (setq native-comp-async-query-on-exit nil)

  ;; Git Gutter configuration
  (use-package git-gutter
    :hook (prog-mode . git-gutter-mode)
    :config
    (setq git-gutter:update-interval 0.02))
#+end_src

* Tree-sitter Support
Configures tree-sitter for enhanced syntax parsing and highlighting.

#+begin_src emacs-lisp
  ;; Ensure tree-sitter grammars are installed
  (use-package treesit
    :straight (:type built-in)
    :config
    (setq treesit-language-source-alist
          '((python "https://github.com/tree-sitter/tree-sitter-python")
            (typescript "https://github.com/tree-sitter/tree-sitter-typescript" "master" "typescript/src")
            (tsx "https://github.com/tree-sitter/tree-sitter-typescript" "master" "tsx/src")
            (javascript "https://github.com/tree-sitter/tree-sitter-javascript")
            (go "https://github.com/tree-sitter/tree-sitter-go")
            (sql "https://github.com/m-novikov/tree-sitter-sql")))

    ;; Auto-install grammars if they're missing
    (dolist (grammar treesit-language-source-alist)
      (unless (treesit-language-available-p (car grammar))
        (treesit-install-language-grammar (car grammar))))

    ;; Use tree-sitter modes when available
    (with-eval-after-load 'sql  ;; Only remap sql-mode after it's loaded
      (setq major-mode-remap-alist
            '((python-mode . python-ts-mode)
              (typescript-mode . typescript-ts-mode)
              (js-mode . js-ts-mode)
              (js2-mode . js-ts-mode)
              (go-mode . go-ts-mode)
              (sql-mode . sql-ts-mode))))

    ;; Ensure font-lock works well
    (setq treesit-font-lock-level 4))
#+end_src

* Project
** Reference
Key bindings and features available through project.el with the =C-c p= prefix.

*** File Navigation
- =C-c p f= - Find file in project (=project-find-file=)
- =C-c p d= - Find directory in project (=project-find-dir=)
- =C-c p b= - Switch to project buffer (=project-switch-to-buffer=)
- =C-c p s= - Search project with regexp (=project-find-regexp=)

*** Project Management
- =C-c p p= - Switch to another project (=project-switch-project=)
- =C-c p k= - Kill project buffers (=project-kill-buffers=)
- =C-c p v= - Run VC commands on project (=project-vc-dir=)
- =C-c p != - Run shell command in project root (=project-shell-command=)
- =C-c p &= - Run async shell command in project root (=project-async-shell-command=)
- =C-c p e= - List project files in dired (=project-dired=)

*** Shell Integration
- =C-c p e= - Run eshell in project root (=project-eshell=)
- =C-c p t= - Start eat terminal in project root (=efs/project-eat=)

*** Buffer Management
- =C-c p b= - Switch to project buffer
- =C-c p k= - Kill all project buffers
- =C-c p C-b= - Display list of all project buffers

*** Command Execution
- =C-c p x= - Run a project-specific command (=project-execute-extended-command=)
              Like =M-x= but limited to project-related commands

*** Additional Features
- Integration with xref for finding definitions
- Built-in VC (version control) operations
- Remote projects support through TRAMP

