.emacs.d/init.el

(use-package ob-go
  :defer t
  :after org)

(use-package ob-mermaid
  :defer t
  :after org
  :config
  (setq ob-mermaid-cli-path (expand-file-name "~/.nvm/versions/node/v18.16.0/bin/mmdc")))

(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   (mermaid . t)
   (shell . t)
   (python . t)
   (go . t)))

;; YAML Mode Configuration
(use-package yaml-mode
  :mode ("\\.ya?ml\\'" . yaml-mode)
  :hook (yaml-mode . (lambda ()
                      (define-key yaml-mode-map "\C-m" 'newline-and-indent))))

;; Markdown Mode for composing, editing, and reviewing markdown documents
(use-package markdown-mode
  :mode (("README\\.md\\'" . gfm-mode)
         ("\\.md\\'" . markdown-mode)
         ("\\.markdown\\'" . markdown-mode))
  :init
  (setq markdown-command "pandoc")  ;; Use pandoc for previewing
  :custom
  (markdown-fontify-code-blocks-natively t)  ;; Syntax highlight code blocks
  (markdown-enable-math t)  ;; Enable LaTeX math support
  (markdown-enable-wiki-links t)  ;; Enable wiki-style links
  (markdown-italic-underscore t)  ;; Use underscores for italic
  (markdown-asymmetric-header t)  ;; Don't add trailing # on headers
  (markdown-gfm-additional-languages '("shell" "bash" "python" "sql" "go" "typescript"))
  (markdown-header-scaling t)  ;; Scale headers
  (markdown-header-scaling-values '(1.5 1.3 1.1 1.0 1.0 1.0))  ;; Header scaling factors
  (markdown-hide-urls nil)  ;; Show URLs
  (markdown-indent-on-enter t)  ;; Automatically indent new lines
  (markdown-make-gfm-checkboxes-buttons t)  ;; Make checkboxes clickable
  :config
  ;; Use visual-line-mode and visual-fill-column-mode for better text wrapping
  (add-hook 'markdown-mode-hook #'visual-line-mode)
  (add-hook 'markdown-mode-hook (lambda ()
                                  (setq visual-fill-column-width efs/default-fill-column)
                                  (visual-fill-column-mode 1)))
  
  ;; Key bindings
  :bind (:map markdown-mode-map
         ("C-c C-s a" . markdown-table-align)  ;; Align tables
         ("C-c C-s t" . markdown-toc-generate-toc)  ;; Generate TOC
         ("C-c C-s p" . markdown-live-preview-mode)  ;; Toggle preview
         ("C-c C-s m" . markdown-toggle-markup-hiding)  ;; Toggle markup hiding
         ("C-c C-x i" . markdown-insert-image)))  ;; Insert image

;; Live preview of Markdown
(use-package markdown-preview-mode
  :after markdown-mode
  :custom
  (markdown-preview-stylesheets
   '("https://cdnjs.cloudflare.com/ajax/libs/github-markdown-css/5.2.0/github-markdown.min.css"))
  :config
  (add-to-list 'markdown-preview-javascript
               "https://cdnjs.cloudflare.com/ajax/libs/highlight.js/11.7.0/highlight.min.js"))

;; Add markdown table of contents support
(use-package markdown-toc
  :after markdown-mode)

;; Imenu integration for markdown headers
(add-hook 'markdown-mode-hook
          (lambda ()
            (setq imenu-generic-expression
                  '(("Heading 1" "^# \\(.+\\)" 1)
                    ("Heading 2" "^## \\(.+\\)" 1)
                    ("Heading 3" "^### \\(.+\\)" 1)
                    ("Heading 4" "^#### \\(.+\\)" 1)
                    ("Heading 5" "^##### \\(.+\\)" 1)
                    ("Heading 6" "^###### \\(.+\\)" 1)))))

;; Enable flyspell for spell checking in markdown documents
(add-hook 'markdown-mode-hook 'flyspell-mode)

;; Integrate with markdownlint if available
(when (executable-find "markdownlint")
  (use-package flymake-markdownlint
    :after markdown-mode
    :hook (markdown-mode . flymake-markdownlint-setup)))

;; Magit configuration
(use-package magit
  :commands magit-status
  :custom
  (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1)
  (git-commit-summary-max-length 88)
  (git-commit-fill-column 88)
  :bind
  ("C-x g" . magit-status)
  ("C-x M-g" . magit-dispatch))

;; Optional: show git changes in the gutter/fringe
;; Configure native-comp warnings before git-gutter
(when (and (fboundp 'native-comp-available-p)
           (native-comp-available-p))
  (setq native-comp-async-report-warnings-errors 'silent) ; Silence all native-comp warnings
  ;; Optional: if you want to only silence specific warnings
  (add-to-list 'native-comp-eln-load-path (expand-file-name "eln-cache/" user-emacs-directory)))

;; This setting is safe regardless of native-comp support
(setq native-comp-async-query-on-exit nil)

;; Git Gutter configuration
(use-package git-gutter
  :hook (prog-mode . git-gutter-mode)
  :config
  (setq git-gutter:update-interval 0.02))

;; Ensure tree-sitter grammars are installed
(use-package treesit
  :straight (:type built-in)
  :config
  (setq treesit-language-source-alist
        '((python "https://github.com/tree-sitter/tree-sitter-python")
          (typescript "https://github.com/tree-sitter/tree-sitter-typescript" "master" "typescript/src")
          (tsx "https://github.com/tree-sitter/tree-sitter-typescript" "master" "tsx/src")
          (javascript "https://github.com/tree-sitter/tree-sitter-javascript")
          (go "https://github.com/tree-sitter/tree-sitter-go")
          (sql "https://github.com/m-novikov/tree-sitter-sql")))

  ;; Auto-install grammars if they're missing
  (dolist (grammar treesit-language-source-alist)
    (unless (treesit-language-available-p (car grammar))
      (treesit-install-language-grammar (car grammar))))

  ;; Use tree-sitter modes when available
  (with-eval-after-load 'sql  ;; Only remap sql-mode after it's loaded
    (setq major-mode-remap-alist
          '((python-mode . python-ts-mode)
            (typescript-mode . typescript-ts-mode)
            (js-mode . js-ts-mode)
            (js2-mode . js-ts-mode)
            (go-mode . go-ts-mode)
            (sql-mode . sql-ts-mode))))

  ;; Ensure font-lock works well
  (setq treesit-font-lock-level 4))
