.emacs.d/Emacs.org
*** Common Customization Variables
These variables are already set in our configuration, shown here for reference:

- =project-list-file= - Where project.el saves the project list
- =project-vc-extra-root-markers= - Additional markers to identify project roots
- =project-switch-commands= - Default command when switching projects
- =project-ignored-directories= - Directories to ignore in project operations
- =project-ignored-globs= - File patterns to ignore in project operations

** Code
#+begin_src emacs-lisp
  ;; Ensure we use built-in project package
  (use-package project
    :straight (:type built-in)  ;; Tell straight.el this is a built-in package
    :demand t  ;; Load immediately to avoid conflicts
    :bind-keymap
    ("C-c p" . project-prefix-map)  ;; Similar to projectile's prefix
    :custom
    (project-list-file (locate-user-emacs-file "projects"))
    (project-vc-extra-root-markers '("pyproject.toml" "package.json"))
    (project-switch-commands 'project-find-file)
    (project-ignored-directories '(".venv" "node_modules" ".git"))
    (project-ignored-globs '("*.pyc" "*.o" "*.elc"))
    :config
    ;; Use ripgrep for project searches when available
    (when (executable-find "rg")
      (setq xref-search-program 'ripgrep))

    ;; Set project search paths
    (when (file-directory-p "~/Projects")
      (setq project-switch-commands 'project-dired))

    ;; Bind search to 's' in project keymap
    (define-key project-prefix-map "s" #'project-find-regexp)

    ;; Add eat terminal in project root
    (defun efs/project-eat ()
      "Start or switch to an eat terminal in the project root directory."
      (interactive)
      (if-let* ((project (project-current))
                (root (project-root project))
                (project-name (project-name project))
                (buffer-name (format "*%s-eat*" project-name)))
          (if (get-buffer buffer-name)
              (pop-to-buffer buffer-name)
            (let ((default-directory root)
                  (created-buffer))
              (eat)
              ;; Find the newly created eat buffer
              (setq created-buffer
                    (car (cl-remove-if-not
                          (lambda (buf)
                            (string-match-p "\\*eat\\*" (buffer-name buf)))
                          (buffer-list))))
              (when created-buffer
                (with-current-buffer created-buffer
                  (rename-buffer buffer-name t)))))
        (user-error "Not in a project")))

    ;; Bind eat to 't' in project keymap
    (define-key project-prefix-map "t" #'efs/project-eat))
#+end_src

* Claude Code
** Reference
*** Basic Commands
- ~C-c C c~ - Start Claude in the current project root
- ~C-c C d~ - Start Claude in the current directory
- ~C-c C t~ - Toggle Claude window
- ~C-c C b~ - Switch to the Claude buffer
- ~C-c C k~ - Kill Claude session
- ~C-c C s~ - Send command to Claude
- ~C-c C x~ - Send command with current file and line context
- ~C-c C r~ - Send the current region or buffer to Claude
- ~C-c C e~ - Ask Claude to fix the error at the current point (requires flycheck)
- ~C-c C /~ - Access Claude slash commands menu
- ~C-c C m~ - Show all commands (transient menu)
- ~C-c C y~ - Send return key to Claude (useful for confirming with Claude without switching to the Claude REPL buffer)
- ~C-c C n~ - Send escape key to Claude (useful for saying "No" when Claude asks for confirmation without switching to the Claude REPL buffer)

*** Usage Notes
- With a prefix arg, ~claude-code~, ~claude-code-current-directory~, ~claude-code-send-command~ and ~claude-code-send-command-with-context~ will switch to the Claude terminal buffer after sending the command.
- Use the transient menu with ~C-c C m~ to access all commands.
- For quick access to Claude slash commands like ~/help~, ~/clear~, or ~/compact~, use ~C-c C /~ to open the slash commands menu.

** Code
#+begin_src emacs-lisp
  (use-package claude-code
    :straight (:type git :host github :repo "stevemolitor/claude-code.el" :branch "main"
                     :files ("*.el" (:exclude "demo.gif")))
    :bind-keymap
    ("C-c C" . claude-code-command-map)
    :hook ((claude-code--start . sm-setup-claude-faces))
    :config
    (claude-code-mode))
  (setq claude-code-program "/Users/rod/.claude/local/claude")
  (setq claude-code-startup-delay 0.2)
  (custom-set-faces
     '(claude-code-repl-face ((t (:family "JuliaMono")))))
#+end_src

* Yasnippet
#+begin_src emacs-lisp
  (use-package yasnippet
    :hook (prog-mode . yas-minor-mode)
    :config
    (yas-reload-all))

  (use-package yasnippet-snippets
    :after yasnippet)
#+end_src

* Company
#+begin_src emacs-lisp
  (use-package company
    :after lsp-mode
    :hook (prog-mode . company-mode)
    :custom
    (company-minimum-prefix-length 1)
    (company-idle-delay 0.0))
#+end_src

* LLMs
#+begin_src emacs-lisp
  (use-package chatgpt-shell
    :config
    (setq chatgpt-shell-openai-key
          (auth-source-pick-first-password :host "api.openai.com"))
    (setq chatgpt-shell-anthropic-key
          (auth-source-pick-first-password :host "api.anthropic.com"))
    (setq chatgpt-shell-model-version "claude-3-7-sonnet-latest"))

  ;; Key bindings for ChatGPT shell commands
  (global-set-key (kbd "C-c s") 'chatgpt-shell)
  (global-set-key (kbd "C-c e") 'chatgpt-shell-prompt-compose)
  (global-set-key (kbd "C-c m") 'chatgpt-shell-swap-model)
#+end_src

* Docker

** Emacs Docker Mode Reference

*** Basic Docker Commands
    | Command                | Description                    | Keybinding |
    |-----------------------+--------------------------------+------------|
    | ~docker~              | Open main Docker menu          | C-c d      |
    | ~docker-containers~   | List all containers            |            |
    | ~docker-images~       | List all images                |            |
    | ~docker-networks~     | List all networks              |            |
    | ~docker-volumes~      | List all volumes               |            |

*** Container Management
    | Command                      | Description                          |
    |------------------------------+--------------------------------------|
    | ~docker-container-start~     | Start container(s)                  |
    | ~docker-container-stop~      | Stop container(s)                   |
    | ~docker-container-restart~   | Restart container(s)                |
    | ~docker-container-pause~     | Pause container(s)                  |
    | ~docker-container-unpause~   | Unpause container(s)                |
    | ~docker-container-rm~        | Remove container(s)                 |
    | ~docker-container-shells~    | Open shell in container             |
    | ~docker-container-logs~      | View container logs                 |

*** Image Management
    | Command                | Description                              |
    |------------------------+------------------------------------------|
    | ~docker-image-pull~    | Pull an image                           |
    | ~docker-image-push~    | Push an image                           |
    | ~docker-image-rm~      | Remove image(s)                         |
    | ~docker-image-inspect~ | Inspect image                           |

*** Docker Compose
    | Command                     | Description                         |
    |-----------------------------+-------------------------------------|
    | ~docker-compose-up~         | Start containers                   |
    | ~docker-compose-down~       | Stop containers                    |
    | ~docker-compose-restart~    | Restart containers                 |
    | ~docker-compose-logs~       | View logs                          |
    | ~docker-compose-build~      | Build services                     |

*** Dockerfile Mode
    | Command                | Description                              |
    |------------------------+------------------------------------------|
    | ~dockerfile-build-buffer~ | Build Dockerfile from current buffer   |
    | ~dockerfile-build-no-cache-buffer~ | Build without cache          |

*** In Container/Image List Buffer
    | Key     | Description                                  |
    |---------+----------------------------------------------|
    | ~?~     | Show help                                    |
    | ~m~     | Mark item                                    |
    | ~u~     | Unmark item                                  |
    | ~t~     | Toggle marks                                 |
    | ~U~     | Unmark all                                   |
    | ~RET~   | Select item                                  |
    | ~q~     | Quit window                                  |

*** Tips
    - Use ~M-x customize-group RET docker~ to customize Docker mode settings
    - Most commands that operate on multiple items work on marked items
    - In listing buffers, press ~?~ to see all available keybindings
    - Use ~docker-container-find-file~ to edit files inside containers

*** Docker Compose Mode Features
    - Syntax highlighting for docker-compose.yml
    - Validation of docker-compose files
    - Auto-completion of services, volumes, and networks
    - YAML validation and linting

*** Common Patterns
    #+BEGIN_SRC org
    1. Starting a new container:
       - M-x docker
       - i (to switch to images)
       - Find desired image
       - c (to create container)

    2. Managing running containers:
       - M-x docker
       - c (to switch to containers)
       - Mark containers with 'm'
       - Perform operations (start/stop/restart)

    3. Viewing logs:
       - In containers list
       - Move to container
       - l (for logs)
    #+END_SRC

** Code
#+begin_src emacs-lisp
  ;; Dockerfile mode for editing Dockerfiles
  (use-package dockerfile-mode
    :ensure t
    :mode ("Dockerfile\\'" . dockerfile-mode))

  ;; Docker management from Emacs
  (use-package docker
    :ensure t
    :bind ("C-c d" . docker)
    :config
    (setq docker-command "docker"))

  ;; docker compose mode
  (use-package docker-compose-mode
    :ensure t)
#+end_src

* Python
** Reference
*Note*: Not all key bindings are test or mapped. That is a work in progress.

*** Core Python Features
**** Tree-sitter Mode
- Modern syntax-aware major mode for Python
- Automatically activated for .py files
- Better syntax highlighting and structural editing

**** Virtual Environment Integration
- Automatically detects and uses project's .venv
- Integrates with python-shell, tools, and LSP
- Helper function ~efs/get-venv-program~ for virtualenv-aware commands

**** Language Server (Eglot + Jedi)
- Code completion
- Go to definition
- Find references
- Documentation on hover
- Signature help
- Symbol renaming
- Auto-imports

*** Code Formatting and Linting
**** Ruff Integration
***** Formatting (automatic on save)
- Code formatting to match black style
- Import sorting (isort functionality)
- Configurable through ~pyproject.toml~ or ~ruff.toml~

***** Linting with Flymake
- Real-time linting using Ruff
- Error navigation:
  - ~M-n~ or ~C-M-n~: Next error
  - ~M-p~ or ~C-M-p~: Previous error
  - ~M-?~ or ~M-g b~: Show diagnostics buffer
- Visual indicators in fringe
- Inline diagnostics in minibuffer via eldoc
- Automatic checking on save and while typing

*** Testing
**** Pytest Integration (~C-c C-x t~)
- Run all tests
- Run current test
- Run tests in current file
- Debug test
- Last failed tests
- Coverage report

*** Additional Tools
**** Poetry
- Automatic virtualenv activation
- Project dependency management
- Environment tracking

**** Docstring Support
- ~M-x python-docstring-insert~: Insert docstring template
- ~TAB~: Navigate through docstring fields
- ~M-q~: Reflow docstring paragraphs
- Syntax highlighting for docstrings

**** Code Folding (Origami)
- ~C-c @ C-c~: Toggle fold at point
- ~C-c @ C-a~: Toggle all folds
- ~C-c @ C-s~: Show all
- ~C-c @ C-h~: Hide all
- ~C-c @ C-f~: Forward fold
- ~C-c @ C-b~: Backward fold

*** Python Mode Key Bindings Cheat Sheet
**** REPL and Shell Integration
- ~C-c C-p~ : Run Python shell
- ~C-c C-z~ : Switch to Python shell
- ~C-c C-c~ : Send current buffer region to shell
- ~C-c C-r~ : Send region to shell
- ~C-c C-s~ : Send statement to shell
- ~C-M-x~   : Send function definition to shell

