.emacs.d/init.el

;; Ensure we use built-in project package
(use-package project
  :straight (:type built-in)  ;; Tell straight.el this is a built-in package
  :demand t  ;; Load immediately to avoid conflicts
  :bind-keymap
  ("C-c p" . project-prefix-map)  ;; Similar to projectile's prefix
  :custom
  (project-list-file (locate-user-emacs-file "projects"))
  (project-vc-extra-root-markers '("pyproject.toml" "package.json"))
  (project-switch-commands 'project-find-file)
  (project-ignored-directories '(".venv" "node_modules" ".git"))
  (project-ignored-globs '("*.pyc" "*.o" "*.elc"))
  :config
  ;; Use ripgrep for project searches when available
  (when (executable-find "rg")
    (setq xref-search-program 'ripgrep))

  ;; Set project search paths
  (when (file-directory-p "~/Projects")
    (setq project-switch-commands 'project-dired))

  ;; Bind search to 's' in project keymap
  (define-key project-prefix-map "s" #'project-find-regexp)

  ;; Add eat terminal in project root
  (defun efs/project-eat ()
    "Start or switch to an eat terminal in the project root directory."
    (interactive)
    (if-let* ((project (project-current))
              (root (project-root project))
              (project-name (project-name project))
              (buffer-name (format "*%s-eat*" project-name)))
        (if (get-buffer buffer-name)
            (pop-to-buffer buffer-name)
          (let ((default-directory root)
                (created-buffer))
            (eat)
            ;; Find the newly created eat buffer
            (setq created-buffer
                  (car (cl-remove-if-not
                        (lambda (buf)
                          (string-match-p "\\*eat\\*" (buffer-name buf)))
                        (buffer-list))))
            (when created-buffer
              (with-current-buffer created-buffer
                (rename-buffer buffer-name t)))))
      (user-error "Not in a project")))

  ;; Bind eat to 't' in project keymap
  (define-key project-prefix-map "t" #'efs/project-eat))

(use-package claude-code
  :straight (:type git :host github :repo "stevemolitor/claude-code.el" :branch "main"
                   :files ("*.el" (:exclude "demo.gif")))
  :bind-keymap
  ("C-c C" . claude-code-command-map)
  :hook ((claude-code--start . sm-setup-claude-faces))
  :config
  (claude-code-mode))
(setq claude-code-program "/Users/rod/.claude/local/claude")
(setq claude-code-startup-delay 0.2)
(custom-set-faces
   '(claude-code-repl-face ((t (:family "JuliaMono")))))

(use-package yasnippet
  :hook (prog-mode . yas-minor-mode)
  :config
  (yas-reload-all))

(use-package yasnippet-snippets
  :after yasnippet)

(use-package company
  :after lsp-mode
  :hook (prog-mode . company-mode)
  :custom
  (company-minimum-prefix-length 1)
  (company-idle-delay 0.0))

(use-package chatgpt-shell
  :config
  (setq chatgpt-shell-openai-key
        (auth-source-pick-first-password :host "api.openai.com"))
  (setq chatgpt-shell-anthropic-key
        (auth-source-pick-first-password :host "api.anthropic.com"))
  (setq chatgpt-shell-model-version "claude-3-7-sonnet-latest"))

;; Key bindings for ChatGPT shell commands
(global-set-key (kbd "C-c s") 'chatgpt-shell)
(global-set-key (kbd "C-c e") 'chatgpt-shell-prompt-compose)
(global-set-key (kbd "C-c m") 'chatgpt-shell-swap-model)

;; Dockerfile mode for editing Dockerfiles
(use-package dockerfile-mode
  :ensure t
  :mode ("Dockerfile\\'" . dockerfile-mode))

;; Docker management from Emacs
(use-package docker
  :ensure t
  :bind ("C-c d" . docker)
  :config
  (setq docker-command "docker"))

;; docker compose mode
(use-package docker-compose-mode
  :ensure t)
