.emacs.d/Emacs.org
**** Navigation and Structure
- ~C-M-a~ : Beginning of defun (class/function)
- ~C-M-e~ : End of defun
- ~C-M-h~ : Mark defun
- ~C-c C-j~ : Jump to definition (using Eglot)
- ~M-{~   : Previous defun
- ~M-}~   : Next defun

**** Code Formatting
- ~C-c <~ : Shift region left
- ~C-c >~ : Shift region right
- ~C-M-\~ : Indent region
- ~TAB~   : Indent line or region

**** Testing (python-pytest)
- ~C-c C-x t~ : Pytest dispatch menu
  - ~t~ : Test at point
  - ~f~ : Test current file
  - ~p~ : Test previous
  - ~r~ : Rerun failed tests
  - ~d~ : Debug test at point

**** Documentation and Help
- ~C-c C-v~ : Python documentation lookup
- ~C-h f~   : Describe function (works with Eglot)
- ~C-c C-d~ : Show documentation for symbol at point

*** Required Python Packages
Install in your project's virtualenv:
#+begin_example
pip install ruff jedi-language-server pytest
#+end_example

*** Configuration Files
**** Example ruff.toml or pyproject.toml
#+begin_example
[tool.ruff]
# Enable flake8-bugbear (`B`) rules
select = ["E", "F", "B"]
# Same as Black
line-length = 88
indent-width = 4
# Assume Python 3.8
target-version = "py38"
#+end_example
** Code

*** Python mode with Eglot and Jedi Language Server
#+begin_src emacs-lisp
  ;; Python Development Configuration

  ;; Find programs in virtual env bin dir or relay on PATH
  (defun efs/get-venv-program (program-name)
    "Get command for PROGRAM-NAME using project's virtualenv.
  Returns a list containing the full path if found in virtualenv,
  otherwise returns a list with just the program name."
    (let* ((project-dir (project-root (project-current t)))
           (venv-dir (when project-dir
                       (expand-file-name ".venv" project-dir)))
           (venv-program (when venv-dir
                           (expand-file-name (concat "bin/" program-name) venv-dir))))
      (if (and venv-program (file-executable-p venv-program))
          (list venv-program)
        (list program-name))))

  ;; Use treesit-based python mode when available
  (use-package python
    :straight (:type built-in)
    :mode ("\\.py\\'" . python-ts-mode)
    :custom
    (python-indent-offset 4)
    ;; Look for .venv in project root
    (python-shell-virtualenv-root (lambda ()
                                    (let ((project-dir (project-root (project-current t))))
                                      (when project-dir
                                        (expand-file-name ".venv" project-dir)))))
    :config
    ;; Function to get the project's virtualenv python
    (defun efs/get-project-python ()
      "Get python executable from project's virtualenv."
      (car (efs/get-venv-program "python")))

    ;; Set python shell interpreter dynamically
    (setq python-shell-interpreter #'efs/get-project-python))

  ;; Configure eglot for Python
  (use-package eglot
    :straight (:type built-in)
    :hook ((python-ts-mode . eglot-ensure)
           (python-mode . eglot-ensure))
    :init (setq eglot-stay-out-of '(flymake))
    :custom
    (eglot-autoshutdown t)  ; Shutdown language server when buffer is closed
    (eglot-send-changes-idle-time 0.1)  ; How quickly to send changes to server
    (eglot-auto-display-help-buffer nil)  ; Don't automatically show help
    :config
    ;; Function to get virtualenv-aware jedi command
    (defun efs/get-jedi-command ()
      "Get jedi-language-server command using project's virtualenv."
      (efs/get-venv-program "jedi-language-server"))

    ;; Register jedi with eglot using dynamic command resolution
    (add-to-list 'eglot-server-programs
                 `((python-ts-mode python-mode) . ,(efs/get-jedi-command))))
#+end_src

*** Python formatting with Ruff
#+begin_src emacs-lisp
  ;; Format Python code with ruff
  (use-package reformatter
    :config
    ;; Function to get ruff formatter command
    (defun efs/get-ruff-command ()
      "Get ruff command from virtualenv or global install."
      (car (efs/get-venv-program "ruff")))

    ;; Define formatters for both format and isort
    (reformatter-define ruff-format
      :program (efs/get-ruff-command)
      :args '("format" "-"))

    (reformatter-define ruff-isort
      :program (efs/get-ruff-command)
      :args '("check" "--select" "I" "--fix" "-"))

    ;; Combined formatting function
    (defun ruff-format-and-sort ()
      "Run ruff format and import sorting on current buffer."
      (interactive)
      (ruff-isort-buffer)
      (ruff-format-buffer))

    ;; Hook to run both on save
    :hook ((python-ts-mode . (lambda ()
                               (add-hook 'before-save-hook #'ruff-format-and-sort nil t)))
           (python-mode . (lambda ()
                            (add-hook 'before-save-hook #'ruff-format-and-sort nil t)))))
#+end_src

*** Pytest
#+begin_src emacs-lisp
  ;; Configure pytest integration
  (use-package python-pytest
    :after python
    :custom
    (python-pytest-confirm t)
    :bind
    (:map python-ts-mode-map
          ("C-c C-x t" . python-pytest-dispatch))
    (:map python-mode-map
          ("C-c C-x t" . python-pytest-dispatch)))
#+end_src

*** Misc Python tools
#+begin_src emacs-lisp
  ;; Legacy support for poetry projects
  (use-package poetry
    :after python
    :config
    (poetry-tracking-mode))

  ;; Improved Python docstring editing
  (use-package python-docstring
    :hook ((python-ts-mode python-mode) . python-docstring-mode))

  ;; Advanced Python folding
  (use-package origami
    :hook ((python-ts-mode python-mode) . origami-mode))
#+end_src

*** Linting with flymake-ruff
#+begin_src emacs-lisp
  ;; Python Linting Configuration
  (use-package flymake
    :straight (:type built-in)
    :custom
    (flymake-fringe-indicator-position 'left-fringe)
    (flymake-suppress-zero-counters t)
    (flymake-start-on-save-buffer t)
    (flymake-no-changes-timeout 0.3)
    :config
    ;; Show flymake diagnostics first in minibuffer
    (setq eldoc-documentation-functions
          (cons #'flymake-eldoc-function
                (remove #'flymake-eldoc-function eldoc-documentation-functions)))
    :hook ((python-ts-mode . flymake-mode)
           (python-mode . flymake-mode)))

  (use-package flymake-ruff
    :straight (flymake-ruff :type git :host github :repo "erickgnavar/flymake-ruff")
    :custom
    (flymake-ruff-program (car (efs/get-venv-program "ruff")))
    :hook ((python-ts-mode . flymake-ruff-load)
           (python-mode . flymake-ruff-load)))
#+end_src

*** DAP Debug
#+begin_src emacs-lisp
  ;; DAP Mode for debugging
  (use-package dap-mode
    :after lsp-mode
    :config
    (dap-auto-configure-mode)
    (require 'dap-python)
    ;; Use debugpy for Python debugging
    (setq dap-python-debugger 'debugpy)
    ;; Get debugpy executable from virtualenv
    (setq dap-python-executable (car (efs/get-venv-program "python")))
    ;; Default to a fixed port
    (setq dap-python-default-debug-port 5678))
#+end_src

* SQL Mode
** Reference
This configuration provides comprehensive SQL editing, formatting, and execution capabilities in Emacs:

*** Key Features
**** SQL Mode Basics
- Syntax highlighting for multiple SQL dialects
- Statement completion
- Indentation and formatting
- Database connectivity with SQLi

**** Dialect Support
- PostgreSQL
- MySQL
- SQLite
- Oracle
- Microsoft SQL Server

**** Tree-sitter Integration
- Enhanced syntax highlighting
- Better structural navigation
- More accurate indentation

*** Common Commands
**** Interactive SQL (SQLi)
- ~C-c C-c~ : Send region or current statement to SQLi buffer
- ~C-c C-r~ : Send region to SQLi buffer
- ~C-c C-s~ : Send current statement to SQLi buffer
- ~C-c C-b~ : Send buffer to SQLi buffer

**** Navigation
- ~C-M-a~ : Move to beginning of statement
- ~C-M-e~ : Move to end of statement
- ~C-M-h~ : Mark current statement
- ~C-M-n~ : Move to next statement
- ~C-M-p~ : Move to previous statement

**** Connection Management
- ~M-x sql-connect~ : Connect to a preconfigured database
- ~M-x sql-product-interactive~ : Start an interactive SQL session

**** Formatting
- ~C-c C-f~ : Format SQL region
- ~TAB~ : Indent line or region

*** Customization
**** Product-Specific Settings
```sql-postgres-login-params``` and similar variables let you customize connection parameters for each database type.

**** Indentation Settings
- ```sql-indent-offset``` controls indentation level (default: 4)
- ```sql-indent-first-column-regexp``` affects what gets indented to column 0

*** Connection Setup
Create a ~/.emacs.d/sql-connections.el file with content like:

```emacs-lisp
(setq sql-connection-alist
      '(("analysis-db"
         (sql-product 'postgres)
         (sql-server "analysis.host.name")
         (sql-user "analyst")
         (sql-password "password")
         (sql-database "analytics")
         (sql-port 5432))
        ("staging-db"
         (sql-product 'postgres)
         (sql-server "localhost")
         (sql-user "airflow")
         (sql-database "airflow")
         (sql-port 15432))))
```

